In [4]:
import sqlite3
import pandas as pd

conn = sqlite3.connect("ladder.db")
pd.read_sql("SELECT * FROM mytable;", conn)

DatabaseError: Execution failed on sql 'SELECT * FROM mytable;': no such table: mytable

In [3]:
conn

In [6]:
conn = sqlite3.connect("ladder.db")
cur = conn.cursor()
cur.execute("select * from table")
conn.commit()

OperationalError: near "table": syntax error

In [7]:
sql=''' select * from pets'''
pd.read_sql(sql,conn)

          name sex  species  age
0        Chloe   F      dog    9
1    Paddinton   M      dog   10
2        Petey   M      dog    7
3        Bella   F      dog    1
4   Glenn Coco   M      cat    6
5       Alanna   F      cat    3
6         Mimi   F      dog    4
7        Midge   F      cat    7
8          Eli   M      dog    8
9        Shuri   F      cat    2
10      Oliver   M      cat    5
11      Dottie   F      cat    3
12      Pinchy   M  lobster    3